{
    "instructions": {
        "instructions": {
            "channel": {
                "name": "anleitung"
            }
        },
        "headline": "# Anleitung zur Nutzung des CS Butler Bots",
        "teams": {
            "description": "**Feature 1: /teams**\nMit dem Befehl `/teams` können Administratoren Teams für ein Spiel erstellen. Der Bot wird zufällig zwei Teams aus den anwesenden Spielern zusammenstellen.\nAlle Spieler müssen sich hierzu im CS2 Voice Channel befinden. Der Befehl muss ebenfalls im Chat des Voice Channels eingegeben werden.\nUm die Session zu beenden und die Spieler wieder in den CS2-Chat zu verschieben, kann der 'End Session'-Button verwendet werden."
        },

        "play": {
            "description": "**Feature 2: /play**\nDer Befehl `/play` sendet eine Privatnachricht in Discord an alle Abonnenten, die eine Einladung zum CS2 Voice Channel enthält, um darüber zu informieren, dass jemand CS2 spielen möchte.\nUm die Privatnachrichten zu erhalten, müssen ggf. die Datenschutzeinstellungen in Discord angepasst werden.",
            "sub_notifications": "\n**Abonnieren oder Deabonnieren der /play-Benachrichtigungen:**",
            "sub1": "Nun kann zwischen 'Subscribe' und 'Unsubscribe' gewählt werden:",
            "sub2": "Anschließend erhält man die Bestätigung des Vorgangs:",
            "usage": "Der `/play`-Befehl kann nun verwendet werden:"
        },

        "map": {
            "description": "**Feature 3: /map**\nDer Befehl `/map` schlägt eine zufällig ausgewählte CS2-Map für Standard- oder Wingman-Spiele vor.",
            "instructions": "Für eine Standard-Map genügt der `/map`-Befehl allein. Um eine Wingman-Map zu erhalten, befolgt bitte die folgenden Schritte:"
        },

        "stats": {
            "description": "**Feature 4: /stats**\nDer Befehl `/stats` zeigt die eigene Counter-Strike-Statistik (CSGO + CS2) aus Steam an.",
            "usage": "Um den Befehl verwenden zu können, muss zuerst die eigene SteamID gespeichert werden. Die SteamID findet sich im Link zu eurem Profil:",
            "privacy_settings": "Das Steamprofil muss bestimmte Datenschutzeinstellungen haben, damit die Statistiken für den Bot zugänglich sind (Statistiken sind erst einige Minuten nach dem Ändern der Einstellungen abrufbar):",
            "link_steamID": "Eure SteamID muss nun mit dem Befehl `/stats steamid 1234567890` mit dem Discord-Konto verknüpft werden. Bitte hier die SteamID einfügen:",
            "usage_complete": "Der `/stats`-Befehl kann nun verwendet werden:"
        },

        "contact_support": "**Für Support, Fehlermeldungen oder Feature-Anfragen, bitte an {mention} wenden. Für weitere Informationen und den Quellcode des Bots besuche {github_link}.**",

        "topic_instructions": "Willkommen zur Anleitung für den CS Butler Bot. Diese Anleitung erklärt die Nutzung des Bots und seine Funktionen.",

        "topic_commands": "Dieser Kanal ist für Befehle des CS Butler reserviert und verhindert die unnötige Nutzung anderer Textkanäle."
    },


    "commands": {
        "maps": {
            "description": "Wählt eine zufällige CS2 Karte.",
            "choice_describe": "Wähle zwischen Standard und Wingman Maps.",
            "response": "Die ausgewählte Karte ist:"
        },

        "play": {
            "description": "Mitglieder zum CS2 spielen Einladen, oder Abonnement verwalten.",
            "choice_describe": "'Subscribe', um sich für Spielbenachrichtigungen für CS2 anzumelden, oder 'Unsubscribe', um sich abzumelden.",
            "sub_response": ", du wurdest für CS2-Spielbenachrichtigungen abonniert.",
            "unsub_response": ", du wurdest von den CS2-Spielbenachrichtigungen abgemeldet.",
            "cooldown": ", du befindest sich in der Abklingzeit. Bitte warte, bevor du diesen Befehl erneut verwendest.",
            "not_subscribed": ", du bist nicht für /play-Benachrichtigungen abonniert. Verwende `/play subscribe`, um zu abonnieren.",
            "inviting": "Einladungen werden gesendet...",
            "priv_message": " möchte CS2 spielen! Trete uns im CS2-Sprachkanal bei: ",
            "mentions": " möchte CS2 spielen.\nDie folgenden Benutzer können aufgrund ihrer Discord-Datenschutzeinstellungen nicht eingeladen werden:",
            "success": "Spieler wurden eingeladen."
        },

        "stats": {
            "description": "Zeige Deine CS2-Statistiken.",
            "choice_describe": "Richte Deine Steam-ID ein.",
            "choice_user_describe": "Zeige Stats für eine beliebige SteamID.",
            "cooldown": "Du befindest dich in der Abklingzeit. Bitte warte 3 Minuten, bevor Du diesen Befehl erneut verwendest.",
            "steamId_setup": "Steam-ID {steamid} wurde eingerichtet für",
            "steamId_missing": "Du hast Deine Steam-ID noch nicht eingerichtet. Verwende `/stats steamid DEINE_STEAM_ID`, um sie einzurichten.",
            "privacy_settings_error": "Die Steam-Privatsphäre-Einstellungen verhindern den Zugriff auf die Statistiken. Siehe {channel} für Unterstützung bei der Änderung der Einstellungen."
        },

        "teams": {
            "end_button": "Sitzung beenden",
            "permission_error": "Du hast keine Berechtigung, diesen Befehl zu verwenden.",
            "description": "Erstellt und verschiebt Benutzer in Teams.",
            "wrong_channel": "Du kannst den Befehl `/teams` nur im CS2-Voice-Kanal verwenden.",
            "not_in_channel": "Du musst im 'CS2'-Voice-Kanal sein, um diesen Befehl zu verwenden.",
            "not_enough": "Es gibt nicht genügend Mitglieder im CS2-Kanal, um Teams zu erstellen.",
            "creating_teams": "Teams werden erstellt und Mitglieder verschoben...",
            "embed_title": "Teams erstellt und Spieler verschoben.",
            "moved_back": "Alle Spieler wurden zurück nach CS2 verschoben."
        },

        "vac_check": {
            "description": "Überprüfe den VAC-Ban-Status für eine bestimmte Steam-ID.",
            "describe": "Gib die Steam-ID ein, die du auf VAC-Bans überprüfen möchtest.",
            "steamid_exists": "Diese Steam-ID wird bereits auf VAC-Bans überwacht. Du erhältst Benachrichtigungen, falls der Spieler gebannt wird.",
            "invalid_input": "Ungültige Eingabe. Bitte gib eine gültige Steam-ID ein. Du kannst eine Steam-ID von einer benutzerdefinierten URL erhalten, indem du {url} besuchst.",
            "watch_status": "Diese Steam-ID wird nun auf VAC-Bans überwacht. Du erhältst Benachrichtigungen, falls der Spieler innerhalb der nächsten 360 Tage VAC-gebanned wird.",
            "no_information": "Keine VAC-Informationen für diese Steam-ID gefunden.",
            "no_ban_information": "Keine Ban-Informationen für die Steam-ID gefunden: {steam_id}. Entferne aus der Datenbank..."
        }
    }
}