{
    "instructions": {
        "instructions": {
            "channel": {
                "name": "instructions"
            }
        },
        "headline": "# Guide to Using the CS Butler Bot",
        "teams": {
            "description": "**Feature 1: /teams**\nThe /teams command allows administrators to create teams for a game. The bot will randomly assemble two teams from the players present.\nAll players must be in the CS2 Voice Channel for this. The command must also be entered in the Voice Channel chat.\nTo end the session and move players back to the CS2 chat, the 'End Session' button can be used."
        },
        
        "play": {
            "description": "**Feature 2: /play**\nThe `/play` command sends a private message in Discord to all subscribers containing an invitation to the CS2 Voice Channel, informing them that someone wants to play CS2.\nTo receive the private messages, Discord privacy settings may need to be adjusted.",
            "sub_notifications": "\n**Subscribe or Unsubscribe to /play Notifications:**",
            "sub1": "You can now choose between 'Subscribe' and 'Unsubscribe':",
            "sub2": "Then you will receive confirmation of the process:",
            "usage": "The `/play` command can now be used:"
        },

        "map": {
            "description": "**Feature 3: /map**\nThe `/map` command suggests a randomly selected CS2 map for standard or wingman games.",
            "instructions": "For a standard map, simply use the `/map` command alone. To get a wingman map, please follow the steps below:"
        },

        "stats": {
            "description": "**Feature 4: /stats**\nThe `/stats` command displays your own Counter-Strike statistics (CSGO + CS2) from Steam.",
            "usage": "To use the command, you must first save your own SteamID. The SteamID can be found in the link to your profile:",
            "privacy_settings": "The Steam profile must have certain privacy settings for the bot to access the statistics (statistics are only available a few minutes after changing the settings):",
            "link_steamID": "Your SteamID must now be linked to the Discord account with the `/stats steamid 1234567890` command. Please insert your SteamID here:",
            "usage_complete": "The `/stats` command can now be used:",
            "get_user": "You can also view the stats for any Steam ID by using `/stats user <ANY_STEAM_ID>`."
        },

        "vac_check": {
            "description": "**Feature 5: /vac_check**\nThe `/vac_check` command checks the VAC ban status for a given Steam ID and monitors it for 360 days.",
            "instructions": "`/vac_check 1234567890`: Checks the VAC ban status for the Steam ID 1234567890.",
            "conclusion": "Upon successful input, an overview of the current VAC ban information for the specified Steam ID will be displayed. If the monitored Steam ID receives a VAC ban within the next 360 days, the bot will post a notification in the 'vac-watcher' channel to inform you."
        },

        "contact_support": "**For support, error reports, or feature requests, please contact {mention}. For more information and the source code of the bot, visit {github_link}.**",

        "topic_instructions": "Welcome to the guide for the CS Butler Bot. This guide explains how to use the bot and its features.",

        "topic_commands": "This channel is reserved for commands of the CS Butler and prevents unnecessary use of other text channels.",

        "topic_vac_watcher": "This channel displays all players from the watchlist who have received a successful VAC ban."
    },


    "commands": {
        "maps": {
            "description": "Selects a random CS2 map.",
            "choice_describe": "Choose between standard or wingman maps.",
            "response": "The choosen Map is:"
        },

        "play": {
            "description": "Let everyone know you want to play CS2 or manage your subscription.",
            "choice_describe": "Choose 'subscribe' to subscribe or 'unsubscribe' to unsubscribe from play notifications for CS2",
            "sub_response": ", you have been subscribed to CS2 play notifications.",
            "unsub_response": ", you have been unsubscribed from CS2 play notifications.",
            "cooldown":  ", you are on cooldown. Please wait before using this command again.",
            "not_subscribed": ", you are not subscribed to /play notifications. Use `/play subscribe` to subscribe.",
            "inviting": "Sending invites...",
            "priv_message": " wants to play CS2! Join us in the CS2 voice channel: ",
            "mentions": " wants to play CS2.\nCan't invite the following users, due to their discord privacy settings: ",
            "success": "Players have been invited."
        },

        "stats": {
            "description": "Show CS2 Stats.",
            "choice_describe": "Setup your Steam ID.",
            "choice_user_describe": "Show Stats for any given SteamID.",
            "cooldown": "You are on cooldown, please wait 3 Minutes before using this command again.",
            "steamId_setup": "Steam ID {steamid} has been set up for",
            "steamId_missing": "You have not set up your Steam ID yet. Use `/stats steamid YOUR_STEAM_ID` to set it up.",
            "privacy_settings_error": "The Steam privacy settings prevent access to the statistics. Please check the instructions in the {channel} for assistance with changing the settings."
        },

        "teams": {
            "end_button": "End Session",
            "permission_error": "You do not have permission to use this command.",
            "description": "Creates and moves Users to Teams.",
            "wrong_channel": "You can only use the `/teams` command in the CS2 voice channel.",
            "not_in_channel": "You need to be in the 'CS2' voice channel to use this command.",
            "not_enough": "There are not enough members in the CS2 channel to create teams.",
            "creating_teams": "Creating teams and moving members...",
            "embed_title": "Teams created and members moved.",
            "moved_back": "Moved all members back to CS2."
        },

        "vac_check": {
            "description": "Check VAC ban status for a given Steam ID.",
            "describe": "Enter the Steam ID you want to check for VAC bans.",
            "steamid_exists": "This Steam ID is already being monitored for VAC bans. You will receive notifications if the player gets banned.",
            "invalid_input": "Invalid input. Please enter a valid Steam ID. You can find a Steam ID from a custom URL by visiting [SteamRep](https://steamrep.com/).",
            "watch_status": "This Steam ID is now being monitored for VAC bans. You will receive notifications if the player gets VAC banned within the next 360 days.",
            "no_information": "No VAC information found for this Steam ID.",
            "no_ban_information": "No ban information found for Steam ID: {steam_id}. Removing from the database..."
        }
    }
}